src/srm_client/templates/DestroyRecoveryPlan_Task.xml

<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <DestroyRecoveryPlan_Task xmlns="urn:internaldr0">
      <_this xsi:type="p7:ManagedObjectReference" type="DrRecoveryRecoveryManager" xmlns:p7="urn:internalvim25">DrRecoveryManager2</_this>
      <plan type="DrRecoveryRecoveryPlan">{{ key }}</plan>
    </DestroyRecoveryPlan_Task>
  </soap:Body>
</soap:Envelope>
